feat: package cli for global install, overhaul docs and build system
